Week05

#17 Resampling pada data deret waktu(time series data)

Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

In [3]:
n_rows = 365 * 24
n_cols = 2
cols = ['col1','cols2']

df = pd.DataFrame(np.random.randint(1,20, size=(n_rows,n_cols)),
                 columns=cols)

df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
df

D:\Anaconda\lib\site-packages\pandas\util\__init__.py:15: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

                     col1  cols2
2000-01-01 00:00:00    13     19
2000-01-01 01:00:00    18      8
2000-01-01 02:00:00     1      2
2000-01-01 03:00:00     1     18
2000-01-01 04:00:00    17      9
...                   ...    ...
2000-12-30 19:00:00     6     18
2000-12-30 20:00:00    14      3
2000-12-30 21:00:00    14     12
2000-12-30 22:00:00    18      4
2000-12-30 23:00:00     8     13

[8760 rows x 2 columns]

Mencoba resamplng  data dengan interval monthly

In [4]:
df.resample('M')['col1'].sum().to_frame()

            col1
2000-01-31  7489
2000-02-29  6754
2000-03-31  7494
2000-04-30  7207
2000-05-31  7470
2000-06-30  7208
2000-07-31  7455
2000-08-31  7409
2000-09-30  7130
2000-10-31  7587
2000-11-30  7135
2000-12-31  7268

Resampling data dengan interval daily

In [5]:
df.resample('D')['col1'].sum().to_frame()

            col1
2000-01-01   269
2000-01-02   198
2000-01-03   253
2000-01-04   227
2000-01-05   255
...          ...
2000-12-26   259
2000-12-27   241
2000-12-28   276
2000-12-29   212
2000-12-30   253

[365 rows x 1 columns]

In [6]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

Membuat Data Frame dari Dictionary

In [7]:
pd.DataFrame({'col1': [1,2,3,4],
            'col2' :[5,6,7,8]})

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8

Membentuk Data Frame dari Numpy Array

In [8]:
n_rows = 5
n_cols = 3

arr = np.random.randint(1, 20, size=(n_rows, n_cols))
arr

array([[15, 15, 18],
       [19, 13, 14],
       [18, 12, 16],
       [ 3, 14, 10],
       [19, 17, 18]])

In [9]:
pd.DataFrame(arr,columns=tuple('ABC'))

    A   B   C
0  15  15  18
1  19  13  14
2  18  12  16
3   3  14  10
4  19  17  18

Membentuk Data Frame dengan Menggunakan method pandas.util.testing

In [10]:
pd.util.testing.makeDataFrame().head()

                   A         B         C         D
Jy9DZTAHAC -0.527471 -2.554844  0.223262  1.862660
rkpzGoxyS2  1.003221 -0.134710 -0.448280 -0.817106
8kT5euU5zb  1.209106 -0.815250  0.837620  0.346454
ng7MgrUcst -1.708337  2.280836  0.903916 -0.466756
EfetHwaVQg -0.520978  0.233042 -0.089149 -0.452389

In [11]:
pd.util.testing.makeMixedDataFrame().head()

     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

In [12]:
pd.util.testing.makeTimeDataFrame().head()

                   A         B         C         D
2000-01-03  0.774178  0.448570 -0.014064 -0.959360
2000-01-04  0.728085  1.308539  0.460078 -1.618593
2000-01-05 -0.587010 -2.200230 -2.221132 -0.086177
2000-01-06 -0.334074  0.498828  2.272277 -0.493774
2000-01-07 -0.949300 -0.168326 -0.458611  0.784215

In [14]:
pd.util.testing.makeMissingDataframe().head()

                   A         B         C         D
Nt2ZFYkoM5  0.443599 -0.076879  1.022550       NaN
bZAg9qD7BB  1.837420  0.672912       NaN -0.068567
iIvBoOVjns  0.568509 -0.384864       NaN -1.542570
lmPg6MNpD4 -0.606521 -0.165666  2.460869 -0.667438
PNMAvmvT1X  1.196306  1.997234 -1.169068 -0.628732

#19: Formatting tampilan Data Frame

In [37]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

In [38]:
n_rows = 5
n_cols = 2
cols = ['omset','operational']


df =pd.DataFrame(np.random.randint(1,20, size=(n_rows, n_cols)),
                columns=cols)
df

   omset  operational
0      6           17
1      1            2
2      6            9
3      5            4
4     18            3

In [39]:
df['omset'] =df['omset'] * 100_000
df['operational'] =df['operational'] *10_000
df

     omset  operational
0   600000       170000
1   100000        20000
2   600000        90000
3   500000        40000
4  1800000        30000

In [40]:
df.index =pd.util.testing.makeDateIndex(n_rows, freq='D')
df = df.reset_index()
df = df.rename(columns={'index':'tanggal'})
df

     tanggal    omset  operational
0 2000-01-01   600000       170000
1 2000-01-02   100000        20000
2 2000-01-03   600000        90000
3 2000-01-04   500000        40000
4 2000-01-05  1800000        30000

Melakukan formatting tampilan Data Frame

In [41]:
formatku = {'tanggal':'{:%d/%m/%y}',
           'operational':'rp {:.2f}',
           'omset':'rp {:.2f}'}
laporan = df.style.format(formatku)
laporan

In [42]:
type(laporan)

pandas.io.formats.style.Styler

In [43]:
laporan.hide_index()

In [46]:
laporan.set_caption('Data omset  dan operational')

In [47]:
laporan.highlight_min('omset', color='pink')
laporan.highlight_max('omset', color='lightgreen')

laporan.highlight_min('operational', color='lightblue')
laporan.highlight_max('operational', color='grey')

#20 Menggabungkan(merge) dua Data Frame secara berdampingan

In [48]:
import pandas as pd
print(pd.__version__)

1.3.4

Persiapan Data Frame

In [49]:
d1 = ({'col1': [1,2,3],
            'col2' :[10,20,30]})
df1 = pd.DataFrame(d1)
df1

   col1  col2
0     1    10
1     2    20
2     3    30

In [50]:
d2 = ({'col1': [4,5,6],
            'col2' :[40,50,60]})
df2 = pd.DataFrame(d2)
df2

   col1  col2
0     4    40
1     5    50
2     6    60

Menggabungkan (Merge ) dua data frame yang kita sudah buat sebelumnya secara berdampingan

In [51]:
df = pd.merge(df1,df2, left_index=True, right_index=True)
df

   col1_x  col2_x  col1_y  col2_y
0       1      10       4      40
1       2      20       5      50
2       3      30       6      60